Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: In earlier versions, use $HTTP_POST_VARS.
pt_br: Em versões anteriores, use $HTTP_POST_VARS.

source: You don' t need to do a global $_POST; to access it within functions or methods, as you do with $HTTP_POST_VARS.
pt_br: Você não precisa fazer um global $_POST; para pode acessá-la dentro de funções ou métodos, como era necessário com $HTTP_POST_VARS.

source: $HTTP_POST_VARS contains the same initial information, but is not an autoglobal. (Note that HTTP_POST_VARS and $_POST are different variables and that PHP handles them as such)
pt_br: $HTTP_POST_VARS contém as mesmas informações, mas não é uma superglobal. (Note que HTTP_POST_VARS e $_POST são variáveis diferentes como também o PHP as manipula diferentemente)

source: If the register_globals directive is set, then these variables will also be made available in the global scope of the script; i.e., separate from the $_POST and $HTTP_POST_VARS If the register_globals directive is set, then these variables will also be made available in the global scope of the script; i.e., separate from the $_POST and $HTTP_POST_VARS arrays.
pt_br: Para maiores informações, veja o capítulo de segurança entitulado Utilizando registradores globais.

source: In earlier versions, use $HTTP_POST_FILES.
pt_br: Em versões anteriores, use $HTTP_POST_FILES.

source: You don' t need to do a global $_FILES; to access it within functions or methods, as you do with $HTTP_POST_FILES.
pt_br: Você não precisa fazer um global $_FILES; para pode acessá-la dentro de funções ou métodos, como era necessário com $HTTP_FILES_VARS.

source: $HTTP_POST_FILES contains the same information, but is not an autoglobal.
pt_br: $HTTP_POST_FILES contém as mesmas informações, mas não é uma superglobal.

source: If the register_globals directive is set, then these variables will also be made available in the global scope of the script; i.e., separate from the $_FILES and $HTTP_POST_FILES If the register_globals directive is set, then these variables will also be made available in the global scope of the script; i.e., separate from the $_FILES and $HTTP_POST_FILES arrays.
pt_br: Para maiores informações, veja o capítulo de segurança entitulado Utilizando registradores globais.

source: There is no equivalent array in earlier versions.
pt_br: Não há array equivalente em versões anteriores.

source: Prior to PHP 4.3.0, $_FILES information was also included into $_REQUEST.
pt_br: Esta é uma variável 'superglobal', ou automaticamente global.

source: If the register_globals directive is set, then these variables will also be made available in the global scope of the script; i.e., separate from the $_REQUEST array.
pt_br: Para maiores informações, veja o capítulo de segurança entitulado Utilizando registradores globais.

source: In earlier versions, use $HTTP_SESSION_VARS.
pt_br: Em versões anteriores, use $HTTP_SESSION_VARS.

source: An associative array containing session variables available to the current script.
pt_br: Contém um array associativo das variáveis de sessão disponíveis para o script atual.

source: See the Session functions documentation for more information on how this is used.
pt_br: Veja a documentação das funções de Sessões para maiores informações de como utilizá-las.

source: You don' t need to do a global $_SESSION; to access it within functions or methods, as you do with $HTTP_SESSION_VARS.
pt_br: Você não precisa fazer um global $_SESSION; para pode acessá-la dentro de funções ou métodos, como era necessário com $HTTP_SESSION_VARS.

source: $HTTP_SESSION_VARS contains the same information, but is not an autoglobal.
pt_br: $HTTP_SESSION_VARS contém as mesmas informações, mas não é uma superglobal.

source: If the register_globals directive is set, then these variables will also be made available in the global scope of the script; i.e., separate from the $_SESSION and $HTTP_SESSION_VARS arrays.
pt_br: Se a diretiva register_globals está ativa, então essas variáveis tornam-se disponíveis no escopo global do script (por exemplo, separados dos arrays $_SESSION e $HTTP_SESSION_VARS Para maiores informações, veja o capítulo de segurança entitulado Utilizando registradores globais.

source: An associative array containing references to all variables which are currently defined in the global scope of the script.
pt_br: Os nomes das variáveis são as chaves do array.

source: The variable names are the keys of the array.
pt_br: Esta é uma variável 'superglobal', ou automaticamente global.

source: You don' t need to do a global $GLOBALS; to access it within functions or methods.
pt_br: A mensagem de erro anterior: $php_errormsg

source: $php_errormsg is a variable containing the text of the last error message generated by PHP.
pt_br: $php_errormsg é uma variável contendo o texto da última mensagem de erro gerada pelo PHP.

source: This variable will only be available within the scope in which the error occurred, and only if the track_errors configuration option is turned on (it defaults to off).
pt_br: Esta variável somente está disponível no escopo em que o erro ocorreu, e somente se a opção de configuração track_errors está ativa (seu default é off).

source: Table H-1.
pt_br: Tabela H-1.

source: Chapter 5.
pt_br: Capítulo 5.

source: Security
pt_br: Próxima

source: See below for full the explanation of the different combinations.
pt_br: Case 1: only public files served

source: If your web server does not support any way of telling if the request is direct or redirected, you cannot use this option and you must use one of the other ways of running the CGI version documented here.
pt_br: Case 3: setting doc_root or user_dir

source: user_dir expansion happens regardless of the doc_root setting, so you can control the document root and user directory access separately.
pt_br: Case 4:

source: Example 5-5.
pt_br: Exemplo 5-5.

source: / / storing password hash $query = sprintf( "INSERT INTO users(name,pwd) VALUES('%s' ,'%s') ;", addslashes($username), md5($password)); $result = pg_exec($connection, $query); / / querying if user submitted the right password $query = sprintf("SELECT 1 FROM users WHERE name='%s' AND pwd='%s' ;", addslashes($username), md5($password)); $result = pg_exec($connection, $query); if (pg_numrows($result) 0) {echo "Welcome, $username !";} else {echo "Authentication failed for $username .";}
pt_br: SQL Injection

source: Example 5-6.
pt_br: Exemplo 5-6.

source: Example 5-7.
pt_br: Exemplo 5-7.

source: Example 5-8.
pt_br: Exemplo 5-8.

source: Example 5-9.
pt_br: Exemplo 5-9.

source: Example 5-10.
pt_br: Exemplo 5-10.

source: Example 5-11.
pt_br: Exemplo 5-11.

source: Example 5-12.
pt_br: Exemplo 5-12.

source: Example 5-13.
pt_br: Exemplo 5-13.

source: Example 5-1.
pt_br: Exemplo 5-1.

source: Example 5-2....
pt_br: Exemplo 5-2....

source: Example 5-3.
pt_br: Exemplo 5-3.

source: Example 5-4.
pt_br: Exemplo 5-4.

source: Example 5-18.
pt_br: Exemplo 5-18.

source: Example 5-19.
pt_br: Exemplo 5-19.

source: Example 5-20.
pt_br: Exemplo 5-20.

source: This chapter starts with some general security advice, explains the different configuration option combinations and the situations they can be safely used, and describes different considerations in coding for different levels of security.
pt_br: General considerations

source: Example 5-14.
pt_br: Exemplo 5-14.

source: Example 5-15.
pt_br: Exemplo 5-15.

source: Example 5-16.
pt_br: Exemplo 5-16.

source: Example 5-17.
pt_br: Exemplo 5-17.

source: Chapter 43.
pt_br: Capítulo 43.

source: Streams API for PHP Extension Authors
pt_br: Próxima

source: Example 43-1. simple stream example that displays the PHP home page
pt_br: Exemplo 43-1. simple stream example that displays the PHP home page

source: Table 43-1.
pt_br: Tabela 43-1.

source: The PHP Streams API introduces a unified approach to the handling of files and sockets in PHP extension.
pt_br: Streams API for PHP Extension Authors

source: One or more of these values can be combined using the OR operator.
pt_br: Stream open options - - Affects the operation of stream factory functions

source: Table 43-2.
pt_br: Tabela 43-2.

source: php_stream_make_seekable() checks if origstream is seekable.
pt_br: Description

source: Table 43-1. php_stream_make_seekable() return values
pt_br: Tabela 43-1. php_stream_make_seekable() return values

source: Example 43-2.
pt_br: Exemplo 43-2.

source: Example 43-3.
pt_br: Exemplo 43-3.

source: php_stream_dirent char d_name[ MAXPATHLEN]
pt_br: struct php_stream_dirent - - Holds information about a single file during dir scanning

source: php_stream_statbuf struct stat sb
pt_br: struct php_stream_statbuf - - Holds information about a file or URL

source: Table J-1.
pt_br: Tabela J-1.

source: Chapter 2.
pt_br: Capítulo 2.

source: A simple tutorial
pt_br: Próxima

source: Example 2-1.
pt_br: Exemplo 2-1.

source: Example 2-6.
pt_br: Exemplo 2-6.

source: Example 2-7.
pt_br: Exemplo 2-7.

source: Here we would like to show the very basics of PHP in a short simple tutorial.
pt_br: A simple tutorial

source: PHP-enabled web pages are treated just like regular HTML pages and you can create and edit them the same way you normally create regular HTML pages.
pt_br: What do I need?

source: Example 2-2.
pt_br: Exemplo 2-2.

source: Example 2-3.
pt_br: Exemplo 2-3.

source: Example 2-4.
pt_br: Exemplo 2-4.

source: Example 2-5.
pt_br: Exemplo 2-5.

source: Appendix I.
pt_br: Apêndice I.

source: List of Supported Protocols / Wrappers
pt_br: Próxima

source: In addition to these wrappers, as of PHP 4.3, you can write your own wrappers using PHP script and stream_register_wrapper().
pt_br: HTTP and HTTPS

source: A set of macros was introduced into Zend' s API that simplify access to zval containers (see Table 42-1).
pt_br: A set of macros was introduced into Zend' s API that simplify access to zval containers (see Tabela 42-1).

source: Table 42-1.
pt_br: Tabela 42-1.

source: Chapter 32.
pt_br: Capítulo 32.

source: Accepting Arguments
pt_br: Próxima

source: To work around this, you have to use a set of API functions to force a type conversion on every argument that' s being passed (see Table 32-1).
pt_br: To work around this, you have to use a set of API functions to force a type conversion on every argument that' s being passed (see Tabela 32-1).

source: Table 32-1.
pt_br: Tabela 32-1.

source: Figure 32-2 shows the output.
pt_br: Figura 32-2 shows the output.

source: Figure 32-2.
pt_br: Figura 32-2.

source: Example 32-2.
pt_br: Exemplo 32-2.

source: For a description of both structures, see Table 32-2, Table 32-3 and Table 32-4.
pt_br: For a description of both structures, see Tabela 32-2, Tabela 32-3 and Tabela 32-4.

source: Table 32-2.
pt_br: Tabela 32-2.

source: See Table 32-3 for a description.
pt_br: See Tabela 32-3 for a description.

source: For a list of available types, see Table 32-4.
pt_br: For a list of available types, see Tabela 32-4.

source: Table 32-3.
pt_br: Tabela 32-3.

source: Table 32-4.
pt_br: Tabela 32-4.

source: Examples are given in in Example 32-3.
pt_br: Examples are given in in Exemplo 32-3.

source: Example 32-3.
pt_br: Exemplo 32-3.

source: One of the most important issues for language extensions is accepting and dealing with data passed via arguments.
pt_br: Accepting Arguments

source: Figure 32-1.
pt_br: Figura 32-1.

source: A very clever implementation of this can be found in the code handling PHP' s fsockopen() located in ext / standard / fsock.c, as shown in Example 32-1.
pt_br: A very clever implementation of this can be found in the code handling PHP' s fsockopen() located in ext / standard / fsock.c, as shown in Exemplo 32-1.

source: Example 32-1.
pt_br: Exemplo 32-1.

source: The default config.m4 shown in Example 27-1 is a bit more complex:
pt_br: The default config.m4 shown in Exemplo 27-1 is a bit more complex:

source: Example 27-1.
pt_br: Exemplo 27-1.

source: Example 38-1 shows a small demonstration of calling a user function.
pt_br: Exemplo 38-1 shows a small demonstration of calling a user function.

source: Example 38-1.
pt_br: Exemplo 38-1.

source: The file config.m4 is processed by buildconf and must contain all the instructions to be executed during configuration.
pt_br: Reference:

source: For example, these can include tests for required external files, such as header files, libraries, and so on.
pt_br: config.m4

source: M4 Macros for config.m4
pt_br: PHP defines a set of macros that can be used in this process, the most useful of which are described in Tabela 41-1.

source: Macro
pt_br: Tabela 41-1.

source: Example 28-1 shows the source.
pt_br: Exemplo 28-1 shows the source.

source: Example 28-1.
pt_br: Exemplo 28-1.

source: The example source makes use of some features introduced with the Zend version used in PHP 4.1.0 and above, it won 't compile with older PHP 4.0.x versions.
pt_br: Compiling Modules

source: The module shown earlier in Example 28-1 can be enabled with --enable-first_module or --enable-first_module=yes.
pt_br: The module shown earlier in Exemplo 28-1 can be enabled with --enable-first_module or --enable-first_module=yes.

source: Those who know don 't talk.
pt_br: Extending PHP 4.0

source: Those who talk don 't know.
pt_br: Hacking the Core of PHP

source: As soon as this point is reached, it 's time to touch the heart of PHP and take a look at its core, the C code that makes PHP go.
pt_br: Duplicating Variable Contents:

source: Access to initialization entries can also be handled with the macros shown in Table 39-1.
pt_br: Access to initialization entries can also be handled with the macros shown in Tabela 39-1.

source: Table 39-1.
pt_br: Tabela 39-1.

source: Chapter 26.
pt_br: Capítulo 26.

source: Source Layout
pt_br: Próxima

source: Prior to working through the rest of this chapter, you should retrieve clean, unmodified source trees of your favorite Web server.
pt_br: Nota:

source: "Extending PHP" is easier said than done.
pt_br: Overview

source: PHP is such a huge and complex package that its inner workings can only be understood if you make yourself familiar with it by practicing, so we encourage you to work with the source.
pt_br: What Is Zend? and What Is PHP?

source: This might sound a bit confusing at first, but it' s not that complicated (see Figure 24-1).
pt_br: This might sound a bit confusing at first, but it' s not that complicated (see Figura 24-1).

source: Figure 24-1.
pt_br: Figura 24-1.

source: Chapter 25.
pt_br: Capítulo 25.

source: Extension Possibilities
pt_br: Próxima

source: As shown in Figure 24-1 As shown in Figure 24-1 above, PHP can be extended primarily at three points: external modules, built-in modules, and the Zend engine.
pt_br: As shown in Figura 24-1 As shown in Figura 24-1 above, PHP can be extended primarily at three points: external modules, built-in modules, and the Zend engine.

source: Chapter 36.
pt_br: Capítulo 36.

source: Printing Information
pt_br: Próxima

source: For examples of these functions, see Example 36-2.
pt_br: For examples of these functions, see Exemplo 36-2.

source: Example 36-2.
pt_br: Exemplo 36-2.

source: Example 36-1 Example 36-1 shows a source example and its output.
pt_br: Exemplo 36-1 Exemplo 36-1 shows a source example and its output.

source: Example 36-1.
pt_br: Exemplo 36-1.

source: Table 36-1.
pt_br: Tabela 36-1.

source: Figure 36-1.
pt_br: Figura 36-1.

source: These macros automatically set the correspondent type and value, as described in Table 35-1 and Table 35-2.
pt_br: These macros automatically set the correspondent type and value, as described in Tabela 35-1 and Tabela 35-2.

source: The macros in Table 35-1 automatically return from your function, those in Table 35-2 only set the return value; they don't return from your function.
pt_br: The macros in Tabela 35-1 automatically return from your function, those in Tabela 35-2 only set the return value; they don 't return from your function.

source: Table 35-1.
pt_br: Tabela 35-1.

source: Table 35-2.
pt_br: Tabela 35-2.

source: Chapter 31.
pt_br: Capítulo 31.

source: Source Discussion
pt_br: Próxima

source: The parameter list of this declaration is very important; you should keep these parameters in mind (see Table 31-1 for descriptions).
pt_br: The parameter list of this declaration is very important; you should keep these parameters in mind (see Tabela 31-1 for descriptions).

source: Table 31-1.
pt_br: Tabela 31-1.

source: Internally, zend_function_entry is defined as shown in Example 31-1.
pt_br: Internally, zend_function_entry is defined as shown in Exemplo 31-1.

source: Example 31-1.
pt_br: Exemplo 31-1.

source: Table 31-2 shows a list of all the macros that you can use to define functions.
pt_br: Tabela 31-2 shows a list of all the macros that you can use to define functions.

source: Table 31-2.
pt_br: Tabela 31-2.

source: All PHP modules follow a common structure:
pt_br: Module Structure

source: You can see the internal definition of this module in Example 31-2.
pt_br: You can see the internal definition of this module in Exemplo 31-2.

source: Example 31-2.
pt_br: Exemplo 31-2.

source: For reference purposes, you can find a list of the macros involved in declared startup and shutdown functions in Table 31-3.
pt_br: For reference purposes, you can find a list of the macros involved in declared startup and shutdown functions in Tabela 31-3.

source: Table 31-3.
pt_br: Tabela 31-3.

source: For a simple test procedure, you can copy it to your htdocs directory and try it with the source in Example 29-1.
pt_br: For a simple test procedure, you can copy it to your htdocs directory and try it with the source in Exemplo 29-1.

source: Example 29-1.
pt_br: Exemplo 29-1.

source: Calling this PHP file in your Web browser should give you the output shown in Figure 29-1.
pt_br: Calling this PHP file in your Web browser should give you the output shown in Figura 29-1.

source: Figure 29-1.
pt_br: Figura 29-1.

source: Chapter 33.
pt_br: Capítulo 33.

source: Creating Variables
pt_br: Próxima

source: Table 33-1, Table 33-2 and Table 33-3 describe these functions.
pt_br: Tabela 33-1, Tabela 33-2 and Tabela 33-3 describe these functions.

source: Table 33-1.
pt_br: Tabela 33-1.

source: Table 33-2.
pt_br: Tabela 33-2.

source: Table 33-3.
pt_br: Tabela 33-3.

source: This is done using zend_hash_update( )() for associative arrays (see Example 33-3) and zend_hash_index_update() for indexed arrays (see Example 33-4):
pt_br: This is done using zend_hash_update( )() for associative arrays (see Exemplo 33-3) and zend_hash_index_update() for indexed arrays (see Exemplo 33-4):

source: Example 33-3.
pt_br: Exemplo 33-3.

source: Example 33-4.
pt_br: Exemplo 33-4.

source: To create your own constants, you can use the macros in Table 33-6.
pt_br: To create your own constants, you can use the macros in Tabela 33-6.

source: Table 33-6.
pt_br: Tabela 33-6.

source: This is somewhat bad practice, but Table Table 33-5 describes macros that do exactly this task.
pt_br: This is somewhat bad practice, but Table Tabela 33-5 describes macros that do exactly this task.

source: Table 33-5.
pt_br: Tabela 33-5.

source: Example 33-1.
pt_br: Exemplo 33-1.

source: The corresponding type value for longs is IS_LONG (see Example 33-2).
pt_br: The corresponding type value for longs is IS_LONG (see Exemplo 33-2).

source: Example 33-2.
pt_br: Exemplo 33-2.

source: Table 33-4.
pt_br: Tabela 33-4.
